Revit 2026 API

# Element Methods

---

The Element type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element. |
|  | CanBeHidden | Indicates if the element can be hidden in the view. |
|  | CanBeLocked | Identifies if the element can be locked. |
|  | CanDeleteSubelement | Checks if given subelement can be removed from the element. |
|  | CanHaveTypeAssigned | Identifies if the element can have a type assigned. |
|  | CanHaveTypeAssigned(Document, ICollectionElementId) |  |
|  | ChangeTypeId(ElementId) | Changes the type of the element. |
|  | ChangeTypeId(Document, ICollectionElementId, ElementId) |  |
|  | DeleteEntity | Deletes the existing entity created by %schema% in the element |
|  | DeleteSubelement | Removes a subelement from the element. |
|  | DeleteSubelements |  |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | EvaluateAllParameterValues | Evaluates all the parameters' values of the element. |
|  | EvaluateParameterValues |  |
|  | GetChangeTypeAny | Returns ChangeType associated with any change in an element. |
|  | GetChangeTypeElementAddition | Returns ChangeType associated with element addition |
|  | GetChangeTypeElementDeletion | Returns ChangeType associated with element deletion. |
|  | GetChangeTypeGeometry | Returns ChangeType associated with a change in the geometry of an element |
|  | GetChangeTypeParameter(ElementId) | Returns ChangeType associated with a change in a parameter's value |
|  | GetChangeTypeParameter(Parameter) | Returns ChangeType associated with a change in a parameter's value |
|  | GetDependentElements | Get all elements that, from a logical point of view, are the children of this Element. |
|  | GetEntity | Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise. |
|  | GetEntitySchemaGuids | Returns the Schema guids of any Entities stored in this element. |
|  | GetExternalFileReference | Gets information pertaining to the external file referenced by the element. |
|  | GetExternalResourceReference | Gets the ExternalResourceReference associated with a specified external resource type. |
|  | GetExternalResourceReferenceExpanded | Gets the collection of ExternalResourceReference associated with a specified external resource type. |
|  | GetExternalResourceReferences | Gets the map of the external resource references referenced by the element. |
|  | GetExternalResourceReferencesExpanded | Gets the expanded map of the external resource references referenced by the element. |
|  | GetGeneratingElementIds | Returns the ids of the element(s) that generated the input geometry object. |
|  | GetGeometryObjectFromReference | Retrieve one geometric primitive contained in the element given a reference. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetMaterialArea | Gets the area of the material with the given id. |
|  | GetMaterialIds | Gets the element ids of all materials present in the element. |
|  | GetMaterialVolume | Gets the volume of the material with the given id. |
|  | GetMonitoredLinkElementIds | Provides the link instance IDs when the element is monitoring. |
|  | GetMonitoredLocalElementIds | Provides the local element IDs when the element is monitoring. |
|  | GetOrderedParameters | Gets the parameters associated to the element in order. |
|  | GetParameter | Retrieves a parameter from the element given identifier. |
|  | GetParameterFormatOptions | Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists. |
|  | GetParameters | Retrieves the parameters from the element via the given name. |
|  | GetPhaseStatus | Gets the status of a given element in the input phase |
|  | GetSubelements | Returns the collection of element subelements. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetTypeId | Returns the identifier of this element's type. |
|  | GetValidTypes | Obtains a set of types that are valid for this element. |
|  | GetValidTypes(Document, ICollectionElementId) |  |
|  | HasPhases | Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId. |
|  | IsCreatedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order. |
|  | IsDemolishedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order. |
|  | IsExternalFileReference | Determines whether this Element represents an external file. |
|  | IsHidden | Identifies if the element has been permanently hidden in the view. |
|  | IsMonitoringLinkElement | Indicate whether an element is monitoring any elements in any linked models. |
|  | IsMonitoringLocalElement | Indicate whether an element is monitoring other local elements. |
|  | IsPhaseCreatedValid | Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element. |
|  | IsPhaseDemolishedValid | Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element. |
|  | IsValidType(ElementId) | Checks if given type is valid for this element. |
|  | IsValidType(Document, ICollectionElementId, ElementId) |  |
|  | LookupParameter | Attempts to find a parameter on the element which has the given name. |
|  | RefersToExternalResourceReference | Determines whether this Element uses external resources associated with a specified external resource type. |
|  | RefersToExternalResourceReferences | Determines whether this Element uses external resources. |
|  | SetEntity | Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Element Class

Autodesk.Revit.DB Namespace